gcj-cl.org
#+TITLE: Solving Google Code Jam problems in Common Lisp
#+AUTHOR: Sergii Dymchenko
#+EMAIL: kit1980@gmail.com
#+DATE: {{{modification-time(%Y-%m-%d)}}}
#+OPTIONS: num:nil toc:nil

[[https://code.google.com/codejam][Google Code Jam]] is one of the
biggest programming competitions in the world - in 2013 there were over 45000
registrants, of which more than 21000 were able to solve correctly at least one problem input 
(typically, a Code Jam problem is tested on two sets of input data - "small" and "large"). 

For me, the best thing about this particular contest is
that any (freely available) programming language or system can be used
for solving problems. Most competitors use C++ or Java, though.

From my (rather limited) Common Lisp experience and some experience with programming competitions I think that Lisp can be successfully used in contests in general,
and in Google Code Jam in particular.

In this article I present Common Lisp solutions to several Google Code Jam problems, 
demonstrate various aspects of Common Lisp usage in context of coding competitions
and highlight some language features and libraries useful for programming contests.

Goals of the article include persuading more programming contests participants try Common Lisp 
and also luring more seasoned Lisp programmers into programming contests.

Lisp already has some limited presence in Code Jam and almost all of the problems from this article have correct submitted solutions in Lisp
(http://www.go-hero.net/jam site can be used to find submitted solutions in different programming languages). 
I tried to make my solutions a bit better engineered that solutions done in a hurry of the real contest: 
by using modern features like [[http://www.quicklisp.org/][Quicklisp]], 
using standard input/output instead of hard-coded file names, more granular code, etc. I provide links to other peoples' Lisp solutions through the article.

I tried to make coding style of the presented solutions reflect specifics of programming contests (without sacrificing readability too much)
 and multi-paradigm nature of Common Lisp. 
For example, LOOP macro is used extensively in every program except for one, which is meant to be an illustration of a more functional programming style.

I chose one particular Common Lisp implementation - [[http://www.sbcl.org/][Steel Bank Common Lisp]], which is popular, stable and fast.
All programs were tested using SBCL 1.0.29, but should also work with other versions and standard-compliant Common Lisp implementations.

* Problems

** Minimum Scalar Product 
   | Problem link        | [[https://code.google.com/codejam/contest/32016/dashboard#s=p0][Minimum Scalar Product]]                                                                           |
   | Full source         | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2008/Round%201A/A.%20Minimum%20Scalar%20Product/MinimumScalarProduct.lisp][MinimumScalarProduct.lisp]] |
   | More Lisp solutions | http://www.go-hero.net/jam/08/solutions/1/1/Lisp                                                                                                                   |

   This is a very easy problem from Round 1A 2008. 

   It's not too hard to come up with a solution, and the implementation is very simple: just sort two lists and take their scalar product.

#+BEGIN_SRC common-lisp 
(defun dot-product (x y)
  (reduce '+ (mapcar '* x y)) )

(defun min-product (x y)
  (dot-product (sort x #'<) (sort y #'>)) )

(defun do-case (case-num x y)
  (format t "Case #~a: ~a~%" case-num (min-product x y)) )

(defun main ()
  (loop for case-num from 1 to (read) do
       (let (n x y)
         (setf n (read))
         (setf x (loop repeat n collect (read)))
         (setf y (loop repeat n collect (read)))
         (do-case case-num x y) ) ) )
#+END_SRC

** Speaking in Tongues
   | Problem link        | [[https://code.google.com/codejam/contest/1460488/dashboard#s=p0][Speaking in Tongues]]                                                                                               |
   | Full source         | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2012/Qualification%20Round/A.%20Speaking%20in%20Tongues/SpeakingInTongues.lisp][SpeakingInTongues.lisp]]                                                                                                                                                                                                                                                                               |
   | More Lisp solutions | http://www.go-hero.net/jam/12/solutions/0/1/Lisp                                                                                                                                                                                                                   |

This is the easiest problem from Qualification Round 2012. 

This problem is very unusual for Google Code Jam because it has only small input instead of usual small plus large inputs.

My solution demonstrates some aspects of working with strings and hash tables in Common Lisp.

#+BEGIN_SRC common-lisp 
;; Additionally to the sample input/output,
;; figure 'q' -> 'z' (Googlerese -> English) mapping from the problem statement.
;; Finally, 'z' -> 'q' is the only left possibility.
(defparameter *in-sample* "
ejp mysljylc kd kxveddknmc re jsicpdrysi
rbcpc ypc rtcsra dkh wyfrepkym veddknkmkrkcd
de kr kd eoya kw aej tysr re ujdr lkgc jv
qz
")
(defparameter *out-sample* "
our language is impossible to understand
there are twenty six factorial possibilities
so it is okay if you want to just give up
zq
")

(defparameter *mapping* (make-hash-table :test #'equal))

(defun initialize-mapping ()
  (loop for in-char across *in-sample* for out-char across *out-sample* do
       (setf (gethash in-char *mapping*) out-char) ) )

(defun translate (in-string)
  (concatenate 'string
               (loop for in-char across in-string collect
                    (gethash in-char *mapping*) ) ) )

(defun do-case (case-num in-string)
  (format t "Case #~a: ~a~%" case-num (translate in-string)) )

(defun main ()
  (initialize-mapping)
  (loop for case-num from 1 to (read) do
       (let (in-string)
         (setf in-string (read-line))
         (do-case case-num in-string) ) ) )
#+END_SRC

