gcj-cl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Solving Google Code Jam problems in Common Lisp</title>
<!-- 2013-09-30 Mon 00:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Sergii Dymchenko"/>
</head>
<body>
<div id="content">
<h1 class="title">Solving Google Code Jam problems in Common Lisp</h1>
<p>
<a href="https://code.google.com/codejam">Google Code Jam</a> is one of the
biggest programming competitions in the world - in 2013 there were over 45000
registrants, of which more than 21000 were able to solve correctly at least one problem input 
(typically, a Code Jam problem is tested on two sets of input data - "small" and "large"). 
</p>

<p>
For me, the best thing about this particular contest is
that any (freely available) programming language or system can be used
for solving problems. Most competitors use C++ or Java, though.
</p>

<p>
From my (rather limited) Common Lisp experience and some experience with programming competitions I think that Lisp can be successfully used in contests in general,
and in Google Code Jam in particular.
</p>

<p>
In this article I present Common Lisp solutions to several Google Code Jam problems, 
demonstrate various aspects of Common Lisp usage in context of coding competitions
and highlight some language features and libraries useful for programming contests.
</p>

<p>
Goals of the article include persuading more programming contests participants try Common Lisp 
and also luring more seasoned Lisp programmers into programming contests.
</p>

<p>
Lisp already has some limited presence in Code Jam and almost all of the problems from this article have correct submitted solutions in Lisp
(<a href="http://www.go-hero.net/jam">http://www.go-hero.net/jam</a> site can be used to find submitted solutions in different programming languages). 
I tried to make my solutions a bit better engineered that solutions done in a hurry of the real contest: 
by using modern features like <a href="http://www.quicklisp.org/">Quicklisp</a>, 
using standard input/output instead of hard-coded file names, more granular code, etc. I provide links to other peoples' Lisp solutions through the article.
</p>

<p>
I tried to make coding style of the presented solutions reflect specifics of programming contests (without sacrificing readability too much)
 and multi-paradigm nature of Common Lisp. 
For example, LOOP macro is used extensively in every program except for one, which is meant to be an illustration of a more functional programming style.
</p>

<p>
I chose one particular Common Lisp implementation - <a href="http://www.sbcl.org/">Steel Bank Common Lisp</a>, which is popular, stable and fast.
All programs were tested using SBCL 1.0.29, but should also work with other versions and standard-compliant Common Lisp implementations.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Problems</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Minimum Scalar Product</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem link</td>
<td class="left"><a href="https://code.google.com/codejam/contest/32016/dashboard#s=p0">Minimum Scalar Product</a></td>
</tr>

<tr>
<td class="left">Full source</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2008/Round 1A/A. Minimum Scalar Product/MinimumScalarProduct.lisp">MinimumScalarProduct.lisp</a></td>
</tr>

<tr>
<td class="left">More Lisp solutions</td>
<td class="left"><a href="http://www.go-hero.net/jam/08/solutions/1/1/Lisp">http://www.go-hero.net/jam/08/solutions/1/1/Lisp</a></td>
</tr>
</tbody>
</table>

<p>
This is a very easy problem from Round 1A 2008. 
</p>

<p>
It's not too hard to come up with a solution, and the implementation is very simple: just sort two lists and take their scalar product.
</p>

<div class="org-src-container">

<pre class="src src-common-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">dot-product</span> (x y)
  (reduce '+ (mapcar '* x y)) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">min-product</span> (x y)
  (dot-product (sort x #'&lt;) (sort y #'&gt;)) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">do-case</span> (case-num x y)
  (format t <span style="color: #8b2252;">"Case #~a: ~a~%"</span> case-num (min-product x y)) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">main</span> ()
  (<span style="color: #a020f0;">loop</span> for case-num from 1 to (read) do
       (<span style="color: #a020f0;">let</span> (n x y)
         (setf n (read))
         (setf x (<span style="color: #a020f0;">loop</span> repeat n collect (read)))
         (setf y (<span style="color: #a020f0;">loop</span> repeat n collect (read)))
         (<span style="color: #a020f0;">do-case</span> case-num x y) ) ) )
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Speaking in Tongues</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem link</td>
<td class="left"><a href="https://code.google.com/codejam/contest/1460488/dashboard#s=p0">Speaking in Tongues</a></td>
</tr>

<tr>
<td class="left">Full source</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2012/Qualification Round/A. Speaking in Tongues/SpeakingInTongues.lisp">SpeakingInTongues.lisp</a></td>
</tr>

<tr>
<td class="left">More Lisp solutions</td>
<td class="left"><a href="http://www.go-hero.net/jam/12/solutions/0/1/Lisp">http://www.go-hero.net/jam/12/solutions/0/1/Lisp</a></td>
</tr>
</tbody>
</table>

<p>
This is the easiest problem from Qualification Round 2012. 
</p>

<p>
This problem is very unusual for Google Code Jam because it has only small input instead of usual small plus large inputs.
</p>

<p>
My solution demonstrates some aspects of working with strings and hash tables in Common Lisp.
</p>

<div class="org-src-container">

<pre class="src src-common-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Additionally to the sample input/output,</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">figure 'q' -&gt; 'z' (Googlerese -&gt; English) mapping from the problem statement.</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Finally, 'z' -&gt; 'q' is the only left possibility.</span>
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*in-sample*</span> <span style="color: #8b2252;">"</span>
<span style="color: #8b2252;">ejp mysljylc kd kxveddknmc re jsicpdrysi</span>
<span style="color: #8b2252;">rbcpc ypc rtcsra dkh wyfrepkym veddknkmkrkcd</span>
<span style="color: #8b2252;">de kr kd eoya kw aej tysr re ujdr lkgc jv</span>
<span style="color: #8b2252;">qz</span>
<span style="color: #8b2252;">"</span>)
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*out-sample*</span> <span style="color: #8b2252;">"</span>
<span style="color: #8b2252;">our language is impossible to understand</span>
<span style="color: #8b2252;">there are twenty six factorial possibilities</span>
<span style="color: #8b2252;">so it is okay if you want to just give up</span>
<span style="color: #8b2252;">zq</span>
<span style="color: #8b2252;">"</span>)

(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*mapping*</span> (make-hash-table <span style="color: #483d8b;">:test</span> #'equal))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">initialize-mapping</span> ()
  (<span style="color: #a020f0;">loop</span> for in-char across *in-sample* for out-char across *out-sample* do
       (setf (gethash in-char *mapping*) out-char) ) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">translate</span> (in-string)
  (concatenate 'string
               (<span style="color: #a020f0;">loop</span> for in-char across in-string collect
                    (gethash in-char *mapping*) ) ) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">do-case</span> (case-num in-string)
  (format t <span style="color: #8b2252;">"Case #~a: ~a~%"</span> case-num (translate in-string)) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">main</span> ()
  (initialize-mapping)
  (<span style="color: #a020f0;">loop</span> for case-num from 1 to (read) do
       (<span style="color: #a020f0;">let</span> (in-string)
         (setf in-string (read-line))
         (<span style="color: #a020f0;">do-case</span> case-num in-string) ) ) )
</pre>
</div>
</div>
</div>
