gcj-cl.org
** Alien Language
   | Problem link        | [[https://code.google.com/codejam/contest/90101/dashboard#s=p0][Alien Language]]                                                                                  |
   | Full source         | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2009/Qualification%20Round/A.%20Alien%20Language/AlienLanguage-regex.lisp][AlienLanguage-regex.lisp]] |
   | More Lisp solutions | http://www.go-hero.net/jam/09/solutions/0/1/Lisp                                                                                                               |

   This is an easy problem from Qualification Round 2009. 

   A pure algorithmic solution for the problem is not too easy to come up with, but the regular expressions-based solution is almost obvious:
   just replace parentheses in the input with square brackets and treat the result as a regex pattern.

   There is a great regex library for Common Lisp - [[http://weitz.de/cl-ppcre][cl-ppcre]], so let's use it!

#+BEGIN_SRC common-lisp 
(ql:quickload :cl-ppcre)
(use-package :cl-ppcre)

(defparameter *words* nil)

(defun replace-brackets (pattern)
  (regex-replace-all "\\)" (regex-replace-all "\\(" pattern "[") "]") )

(defun count-matches (pattern)
  (let ((scanner (create-scanner pattern)))
    (loop for word in *words* sum
         (if (scan scanner word) 1 0) ) ) )

(defun do-case (case-num pattern)
  (format t "Case #~a: ~a~%" case-num (count-matches (replace-brackets pattern))) )

(defun main ()
  (let (d n)
    (read) ; consume redundant value of L
    (setf d (read))
    (setf n (read))
    (dotimes (i d) (push (read-line) *words*)) ; words are reversed, but it doesn't matter
    (loop for case-num from 1 to n do
         (let (pattern)
           (setf pattern (read-line))
           (do-case case-num pattern) ) ) ) )
#+END_SRC

** Fair Warning
   | Problem link        | [[https://code.google.com/codejam/contest/433101/dashboard#s=p1][Fair Warning]]                                                                                                                                                                                            |
   | Full source         | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2010/Qualification%20Round/B.%20Fair%20Warning/FairWarning.lisp][FairWarning.lisp]]                                                                                                                                                                                                                                                                                                     |
   | More Lisp solutions | http://www.go-hero.net/jam/10/solutions/0/2/Lisp                                                                                                                                                                                                                                                                                                                                                                   |

   This problem from Qualification Round 2010 (the hardest from the round) was the first Code Jam problem that required bignum arithmetic support. 
   
   Common Lisp is very handy for solving this problem because it supports bignum arithmetic out of the box;
   having standard greatest common divisor function also helps.

   The solution I wrote for this particular problem uses a more functional programming style, 
   and [[http://common-lisp.net/project/iterate/][iterate]] is used instead of LOOP macro to stress this.

   Also the program (ab)uses the fact that Common Lisp is a Lisp-2 and has a separate function namespace, 
   so it's ok to have variables with the same names as functions (min, gcd, rem).

#+BEGIN_SRC common-lisp 
(ql:quickload :iterate)
(use-package :iterate)

(defun substract-val (items val)
  (mapcar #'(lambda (x) (- x val)) items) )

(defun first-optimum (events)
  (let* ((min (reduce #'min events))
         (gcd (reduce #'gcd (substract-val events min)))
         (rem (rem min gcd)) )
    (if (zerop rem) 0 (- gcd rem)) ) )
    
(defun do-case (case-num events)
  (format t "Case #~a: ~a~%" case-num (first-optimum events)) )

(defun main ()
  (iterate (for case-num from 1 to (read))
           (let (n events)
             (setf n (read))
             (setf events (iterate (repeat n) (collect (read))))
             (do-case case-num events) ) ) )
#+END_SRC

