gcj-cl.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Alien Language</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem link</td>
<td class="left"><a href="https://code.google.com/codejam/contest/90101/dashboard#s=p0">Alien Language</a></td>
</tr>

<tr>
<td class="left">Full source</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2009/Qualification Round/A. Alien Language/AlienLanguage-regex.lisp">AlienLanguage-regex.lisp</a></td>
</tr>

<tr>
<td class="left">More Lisp solutions</td>
<td class="left"><a href="http://www.go-hero.net/jam/09/solutions/0/1/Lisp">http://www.go-hero.net/jam/09/solutions/0/1/Lisp</a></td>
</tr>
</tbody>
</table>

<p>
This is an easy problem from Qualification Round 2009. 
</p>

<p>
A pure algorithmic solution for the problem is not too easy to come up with, but the regular expressions-based solution is almost obvious:
just replace parentheses in the input with square brackets and treat the result as a regex pattern.
</p>

<p>
There is a great regex library for Common Lisp - <a href="http://weitz.de/cl-ppcre">cl-ppcre</a>, so let's use it!
</p>

<div class="org-src-container">

<pre class="src src-common-lisp">(ql:quickload <span style="color: #483d8b;">:cl-ppcre</span>)
(use-package <span style="color: #483d8b;">:cl-ppcre</span>)

(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*words*</span> nil)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">replace-brackets</span> (pattern)
  (regex-replace-all <span style="color: #8b2252;">"</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">"</span> (regex-replace-all <span style="color: #8b2252;">"</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">"</span> pattern <span style="color: #8b2252;">"["</span>) <span style="color: #8b2252;">"]"</span>) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">count-matches</span> (pattern)
  (<span style="color: #a020f0;">let</span> ((scanner (create-scanner pattern)))
    (<span style="color: #a020f0;">loop</span> for word in *words* sum
         (<span style="color: #a020f0;">if</span> (scan scanner word) 1 0) ) ) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">do-case</span> (case-num pattern)
  (format t <span style="color: #8b2252;">"Case #~a: ~a~%"</span> case-num (count-matches (replace-brackets pattern))) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">main</span> ()
  (<span style="color: #a020f0;">let</span> (d n)
    (read) <span style="color: #b22222;">; </span><span style="color: #b22222;">consume redundant value of L</span>
    (setf d (read))
    (setf n (read))
    (<span style="color: #a020f0;">dotimes</span> (i d) (push (read-line) *words*)) <span style="color: #b22222;">; </span><span style="color: #b22222;">words are reversed, but it doesn't matter</span>
    (<span style="color: #a020f0;">loop</span> for case-num from 1 to n do
         (<span style="color: #a020f0;">let</span> (pattern)
           (setf pattern (read-line))
           (<span style="color: #a020f0;">do-case</span> case-num pattern) ) ) ) )
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Fair Warning</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem link</td>
<td class="left"><a href="https://code.google.com/codejam/contest/433101/dashboard#s=p1">Fair Warning</a></td>
</tr>

<tr>
<td class="left">Full source</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2010/Qualification Round/B. Fair Warning/FairWarning.lisp">FairWarning.lisp</a></td>
</tr>

<tr>
<td class="left">More Lisp solutions</td>
<td class="left"><a href="http://www.go-hero.net/jam/10/solutions/0/2/Lisp">http://www.go-hero.net/jam/10/solutions/0/2/Lisp</a></td>
</tr>
</tbody>
</table>

<p>
This problem from Qualification Round 2010 (the hardest from the round) was the first Code Jam problem that required bignum arithmetic support. 
</p>

<p>
Common Lisp is very handy for solving this problem because it supports bignum arithmetic out of the box;
having standard greatest common divisor function also helps.
</p>

<p>
The solution I wrote for this particular problem uses a more functional programming style, 
and <a href="http://common-lisp.net/project/iterate/">iterate</a> is used instead of LOOP macro to stress this.
</p>

<p>
Also the program (ab)uses the fact that Common Lisp is a Lisp-2 and has a separate function namespace, 
so it's ok to have variables with the same names as functions (min, gcd, rem).
</p>

<div class="org-src-container">

<pre class="src src-common-lisp">(ql:quickload <span style="color: #483d8b;">:iterate</span>)
(use-package <span style="color: #483d8b;">:iterate</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">substract-val</span> (items val)
  (mapcar #'(<span style="color: #a020f0;">lambda</span> (x) (- x val)) items) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">first-optimum</span> (events)
  (<span style="color: #a020f0;">let*</span> ((min (reduce #'min events))
         (gcd (reduce #'gcd (substract-val events min)))
         (rem (rem min gcd)) )
    (<span style="color: #a020f0;">if</span> (zerop rem) 0 (- gcd rem)) ) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">do-case</span> (case-num events)
  (format t <span style="color: #8b2252;">"Case #~a: ~a~%"</span> case-num (first-optimum events)) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">main</span> ()
  (iterate (for case-num from 1 to (read))
           (<span style="color: #a020f0;">let</span> (n events)
             (setf n (read))
             (setf events (iterate (repeat n) (collect (read))))
             (<span style="color: #a020f0;">do-case</span> case-num events) ) ) )
</pre>
</div>
</div>
</div>
