gcj-cl.org
** Triangle Areas
   | Problem link        | [[https://code.google.com/codejam/contest/32001/dashboard#s=p1][Triangle Areas]]                                                          |
   | Full source         | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2008/Round%202/B.%20Triangle%20Areas/TriangleAreas.lisp][TriangleAreas.lisp]] |
   |                     | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2008/Round%202/B.%20Triangle%20Areas/TriangleAreas.ecl][TriangleAreas.ecl]]   |
   | More Lisp solutions | http://www.go-hero.net/jam/08/solutions/4/2/Lisp (small input only)                                                                                                                       |

This is a relatively difficult problem from Round 2 2008. 

Prolog-based [[http://www.eclipseclp.org/][ECLiPSe]] Constraint Programming System does all the real job in my solution. 
Prolog program is almost direct translation of the problem statement, so ECLiPSe is very well suited for this problem.

Common Lisp is used as a scripting language with a little help from [[http://common-lisp.net/project/trivial-shell/][trivial-shell]].
Basically, the Lisp program just translates every input line to Prolog-friendly format and calls ECLiPSe.

#+BEGIN_SRC common-lisp 
(ql:quickload :trivial-shell)

(defun prologify (items)
  (format nil "[~{~A~^, ~}].~%" items) )

(defun run-eclipse (input)
  (trivial-shell:shell-command "eclipse -f TriangleAreas.ecl -e main" :input input) )

(defun main ()
  (format t (run-eclipse (with-output-to-string (str)
                           (let (c)
                             (setf c (read))
                             (format str (prologify (list c)))
                             (loop for case-num from 1 to c do
                                  (let (n m a)
                                    (setf n (read))
                                    (setf m (read))
                                    (setf a (read))
                                    (format str (prologify (list n m a))) ) ) ) ) ) ) )
#+END_SRC

#+BEGIN_SRC eclipse
  :- lib(ic).
  
  % Triangle's area * 2
  area2(X1, Y1, X2, Y2, X3, Y3, A) :- 
      A #= abs(
          X1 * Y2 - X1 * Y3 + 
          X2 * Y3 - X2 * Y1 + 
          X3 * Y1 - X3 * Y2
      ).
  
  model(N, M, A, [X1, Y1, X2, Y2, X3, Y3]) :-
      [X1, X2, X3] :: 0..N,
      [Y1, Y2, Y3] :: 0..M,
      X1 #= 0, Y1 #= 0, % we can safely put one point in (0, 0)
      area2(X1, Y1, X2, Y2, X3, Y3, A).
  
  do_case(Case_num, N, M, A) :-
      printf("Case #%w: ", [Case_num]),
      ( model(N, M, A, Points), labeling(Points) ->
          printf("%w %w %w %w %w %w", Points)
      ; 
          write("IMPOSSIBLE") 
      ),
      nl.
  
  main :-
      read([C]), 
      ( for(Case_num, 1, C) do 
          read([N, M, A]),
          do_case(Case_num, N, M, A) ).
#+END_SRC

** Bullseye
   | Problem link        | [[https://code.google.com/codejam/contest/2418487/dashboard#s=p0][Bullseye]]                                                                                                                                          |
   | Full source         | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2013/Round%201A/A.%20Bullseye/Bullseye.lisp][Bullseye.lisp]] |
   | More Lisp solutions | http://www.go-hero.net/jam/13/solutions/1/1/Lisp                                                                                                                                                |

This is the easiest problem from Round 1A 2013.

The problem exercises a standard programming contest idea - binary search.

My Lisp solution for this problem is probably the most unlispy of the programs in this article because of using infix math syntax. 
Prefix math syntax can be too verbose for this kind of programs, 
and infix syntax simplified translating my Python solution to Common Lisp tremendously.

Common Lisp's bignum arithmetic support also helps in this problem.

#+BEGIN_SRC common-lisp 
(ql:quickload :infix)

(defun paint (r n)
    #I(2*r*n + 2*n*n - n) )

(defun find-max (r paint)
  (let (min_n max_n med_n)
    #I(min_n = 0)
    #I(max_n = paint + 1)
    (loop do
         #I(med_n = ((max_n - min_n) >> 1) + min_n)
         (if #I(paint(r, med_n) <= paint)
             #I(min_n = med_n)
             #I(max_n = med_n) )
       while #I(max_n - min_n > 1) )
    min_n ) )

(defun do-case (case-num r paint)
  (format t "Case #~a: ~a~%" case-num (find-max r paint)) )

(defun main ()
  (loop for case-num from 1 to (read) do
       (let (r paint)
         (setf r (read))
         (setf paint (read))
         (do-case case-num r paint) ) ) )
#+END_SRC

