gcj-cl.html
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Triangle Areas</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem link</td>
<td class="left"><a href="https://code.google.com/codejam/contest/32001/dashboard#s=p1">Triangle Areas</a></td>
</tr>

<tr>
<td class="left">Full source</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2008/Round 2/B. Triangle Areas/TriangleAreas.lisp">TriangleAreas.lisp</a></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2008/Round 2/B. Triangle Areas/TriangleAreas.ecl">TriangleAreas.ecl</a></td>
</tr>

<tr>
<td class="left">More Lisp solutions</td>
<td class="left"><a href="http://www.go-hero.net/jam/08/solutions/4/2/Lisp">http://www.go-hero.net/jam/08/solutions/4/2/Lisp</a> (small input only)</td>
</tr>
</tbody>
</table>

<p>
This is a relatively difficult problem from Round 2 2008. 
</p>

<p>
Prolog-based <a href="http://www.eclipseclp.org/">ECLiPSe</a> Constraint Programming System does all the real job in my solution. 
Prolog program is almost direct translation of the problem statement, so ECLiPSe is very well suited for this problem.
</p>

<p>
Common Lisp is used as a scripting language with a little help from <a href="http://common-lisp.net/project/trivial-shell/">trivial-shell</a>.
Basically, the Lisp program just translates every input line to Prolog-friendly format and calls ECLiPSe.
</p>

<div class="org-src-container">

<pre class="src src-common-lisp">(ql:quickload <span style="color: #483d8b;">:trivial-shell</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">prologify</span> (items)
  (format nil <span style="color: #8b2252;">"[~{~A~^, ~}].~%"</span> items) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">run-eclipse</span> (input)
  (trivial-shell:shell-command <span style="color: #8b2252;">"eclipse -f TriangleAreas.ecl -e main"</span> <span style="color: #483d8b;">:input</span> input) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">main</span> ()
  (format t (run-eclipse (<span style="color: #a020f0;">with-output-to-string</span> (str)
                           (<span style="color: #a020f0;">let</span> (c)
                             (setf c (read))
                             (format str (prologify (list c)))
                             (<span style="color: #a020f0;">loop</span> for case-num from 1 to c do
                                  (<span style="color: #a020f0;">let</span> (n m a)
                                    (setf n (read))
                                    (setf m (read))
                                    (setf a (read))
                                    (format str (prologify (list n m a))) ) ) ) ) ) ) )
</pre>
</div>

<div class="org-src-container">

<pre class="src src-eclipse"><span style="color: #a020f0;">:- lib</span>(<span style="color: #008b8b;">ic</span>).

<span style="color: #b22222;">% Triangle's area * 2</span>
<span style="color: #0000ff;">area2</span>(<span style="color: #a0522d;">X1</span>, <span style="color: #a0522d;">Y1</span>, <span style="color: #a0522d;">X2</span>, <span style="color: #a0522d;">Y2</span>, <span style="color: #a0522d;">X3</span>, <span style="color: #a0522d;">Y3</span>, <span style="color: #a0522d;">A</span>) <span style="color: #483d8b;">:- </span>
    <span style="color: #a0522d;">A</span> <span style="color: #483d8b;">#=</span> <span style="color: #483d8b;">abs</span>(
        <span style="color: #a0522d;">X1</span> * <span style="color: #a0522d;">Y2</span> - <span style="color: #a0522d;">X1</span> * <span style="color: #a0522d;">Y3</span> + 
        <span style="color: #a0522d;">X2</span> * <span style="color: #a0522d;">Y3</span> - <span style="color: #a0522d;">X2</span> * <span style="color: #a0522d;">Y1</span> + 
        <span style="color: #a0522d;">X3</span> * <span style="color: #a0522d;">Y1</span> - <span style="color: #a0522d;">X3</span> * <span style="color: #a0522d;">Y2</span>
    ).

<span style="color: #0000ff;">model</span>(<span style="color: #a0522d;">N</span>, <span style="color: #a0522d;">M</span>, <span style="color: #a0522d;">A</span>, [<span style="color: #a0522d;">X1</span>, <span style="color: #a0522d;">Y1</span>, <span style="color: #a0522d;">X2</span>, <span style="color: #a0522d;">Y2</span>, <span style="color: #a0522d;">X3</span>, <span style="color: #a0522d;">Y3</span>]) <span style="color: #483d8b;">:-</span>
    [<span style="color: #a0522d;">X1</span>, <span style="color: #a0522d;">X2</span>, <span style="color: #a0522d;">X3</span>] <span style="color: #483d8b;">::</span> 0..<span style="color: #a0522d;">N</span>,
    [<span style="color: #a0522d;">Y1</span>, <span style="color: #a0522d;">Y2</span>, <span style="color: #a0522d;">Y3</span>] <span style="color: #483d8b;">::</span> 0..<span style="color: #a0522d;">M</span>,
    <span style="color: #a0522d;">X1</span> <span style="color: #483d8b;">#=</span> 0, <span style="color: #a0522d;">Y1</span> <span style="color: #483d8b;">#=</span> 0, <span style="color: #b22222;">% we can safely put one point in (0, 0)</span>
    area2(<span style="color: #a0522d;">X1</span>, <span style="color: #a0522d;">Y1</span>, <span style="color: #a0522d;">X2</span>, <span style="color: #a0522d;">Y2</span>, <span style="color: #a0522d;">X3</span>, <span style="color: #a0522d;">Y3</span>, <span style="color: #a0522d;">A</span>).

<span style="color: #0000ff;">do_case</span>(<span style="color: #a0522d;">Case_num</span>, <span style="color: #a0522d;">N</span>, <span style="color: #a0522d;">M</span>, <span style="color: #a0522d;">A</span>) <span style="color: #483d8b;">:-</span>
    <span style="color: #483d8b;">printf</span>(<span style="color: #8b2252;">"Case #%w: "</span>, [<span style="color: #a0522d;">Case_num</span>]),
    ( model(<span style="color: #a0522d;">N</span>, <span style="color: #a0522d;">M</span>, <span style="color: #a0522d;">A</span>, <span style="color: #a0522d;">Points</span>), labeling(<span style="color: #a0522d;">Points</span>) <span style="color: #483d8b;">-&gt;</span>
        <span style="color: #483d8b;">printf</span>(<span style="color: #8b2252;">"%w %w %w %w %w %w"</span>, <span style="color: #a0522d;">Points</span>)
    <span style="color: #483d8b;">;</span> 
        <span style="color: #483d8b;">write</span>(<span style="color: #8b2252;">"IMPOSSIBLE"</span>) 
    ),
    <span style="color: #483d8b;">nl</span>.

<span style="color: #0000ff;">main</span> <span style="color: #483d8b;">:-</span>
    <span style="color: #483d8b;">read</span>([<span style="color: #a0522d;">C</span>]), 
    ( <span style="color: #483d8b;">for</span>(<span style="color: #a0522d;">Case_num</span>, 1, <span style="color: #a0522d;">C</span>) <span style="color: #483d8b;">do</span> 
        <span style="color: #483d8b;">read</span>([<span style="color: #a0522d;">N</span>, <span style="color: #a0522d;">M</span>, <span style="color: #a0522d;">A</span>]),
        do_case(<span style="color: #a0522d;">Case_num</span>, <span style="color: #a0522d;">N</span>, <span style="color: #a0522d;">M</span>, <span style="color: #a0522d;">A</span>) ).
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Bullseye</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem link</td>
<td class="left"><a href="https://code.google.com/codejam/contest/2418487/dashboard#s=p0">Bullseye</a></td>
</tr>

<tr>
<td class="left">Full source</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2013/Round 1A/A. Bullseye/Bullseye.lisp">Bullseye.lisp</a></td>
</tr>

<tr>
<td class="left">More Lisp solutions</td>
<td class="left"><a href="http://www.go-hero.net/jam/13/solutions/1/1/Lisp">http://www.go-hero.net/jam/13/solutions/1/1/Lisp</a></td>
</tr>
</tbody>
</table>

<p>
This is the easiest problem from Round 1A 2013.
</p>

<p>
The problem exercises a standard programming contest idea - binary search.
</p>

<p>
My Lisp solution for this problem is probably the most unlispy of the programs in this article because of using infix math syntax. 
Prefix math syntax can be too verbose for this kind of programs, 
and infix syntax simplified translating my Python solution to Common Lisp tremendously.
</p>

<p>
Common Lisp's bignum arithmetic support also helps in this problem.
</p>

<div class="org-src-container">

<pre class="src src-common-lisp">(ql:quickload <span style="color: #483d8b;">:infix</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">paint</span> (r n)
    #I(2*r*n + 2*n*n - n) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">find-max</span> (r paint)
  (<span style="color: #a020f0;">let</span> (min_n max_n med_n)
    #I(min_n = 0)
    #I(max_n = paint + 1)
    (<span style="color: #a020f0;">loop</span> do
         #I(med_n = ((max_n - min_n) &gt;&gt; 1) + min_n)
         (<span style="color: #a020f0;">if</span> #I(paint(r, med_n) &lt;= paint)
             #I(min_n = med_n)
             #I(max_n = med_n) )
       while #I(max_n - min_n &gt; 1) )
    min_n ) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">do-case</span> (case-num r paint)
  (format t <span style="color: #8b2252;">"Case #~a: ~a~%"</span> case-num (find-max r paint)) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">main</span> ()
  (<span style="color: #a020f0;">loop</span> for case-num from 1 to (read) do
       (<span style="color: #a020f0;">let</span> (r paint)
         (setf r (read))
         (setf paint (read))
         (<span style="color: #a020f0;">do-case</span> case-num r paint) ) ) )
</pre>
</div>
</div>
</div>
