gcj-cl.org
** Rope Intranet
   | Problem link        | [[http://code.google.com/codejam/contest/619102/dashboard#s=p0][Rope Intranet]]                                                         |
   | Full source         | [[https://github.com/kit1980/cl-google-code-jam/blob/master/2010/Round%201C/A.%20Rope%20Intranet/RopeIntranet.lisp][RopeIntranet.lisp]] |
   | More Lisp solutions | http://www.go-hero.net/jam/10/solutions/3/1/Lisp                                                                                                                                        |

This is an easy problem from Round 1C 2010.

The problem's constraints are low enough to allow \Omicron(n^2) solutions. 

I use [[https://github.com/Ramarren/cl-geometry][cl-geometry]] library to check whether two line segments intersect.
Using the library for such a simple task is of course an overkill, but cl-geometry has plenty of useful functions that can be handy in solving other problems.

My solution also demonstrates some simple aspects of using Common Lisp Object System.

#+BEGIN_SRC common-lisp 
(ql:quickload :cl-geometry)
(use-package :2d-geometry)

(defun count-intersections (a-list b-list)
  (let (n a b)
    (setf n (length a-list))
    (setf a (make-array n :initial-contents a-list))
    (setf b (make-array n :initial-contents b-list))
    (loop for i from 0 below n sum
      (loop for j from (1+ i) below n sum
           (let (li lj inter)
             (setf li (make-instance 'line-segment
                                     :start (make-instance 'point :x 0 :y (aref a i))
                                     :end (make-instance 'point :x 1 :y (aref b i)) ))
             (setf lj (make-instance 'line-segment
                                     :start (make-instance 'point :x 0 :y (aref a j))
                                     :end (make-instance 'point :x 1 :y (aref b j)) ))
             (setf inter (line-segments-intersection-point li lj))
             (if inter 1 0)) ) ) ) )

(defun do-case (case-num a b)
  (format t "Case #~a: ~a~%" case-num (count-intersections a b)) )

(defun main ()
  (loop for case-num from 1 to (read) do
       (let (n a b)
         (setf n (read))
         (dotimes (i n)
              (push (read) a)
              (push (read) b) )
         ; items in a & b are reversed, but it doesn't matter
         (do-case case-num a b) ) ) )
#+END_SRC
