gcj-cl.html
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Rope Intranet</h3>
<div class="outline-text-3" id="text-1-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Problem link</td>
<td class="left"><a href="http://code.google.com/codejam/contest/619102/dashboard#s=p0">Rope Intranet</a></td>
</tr>

<tr>
<td class="left">Full source</td>
<td class="left"><a href="https://github.com/kit1980/cl-google-code-jam/blob/master/2010/Round 1C/A. Rope Intranet/RopeIntranet.lisp">RopeIntranet.lisp</a></td>
</tr>

<tr>
<td class="left">More Lisp solutions</td>
<td class="left"><a href="http://www.go-hero.net/jam/10/solutions/3/1/Lisp">http://www.go-hero.net/jam/10/solutions/3/1/Lisp</a></td>
</tr>
</tbody>
</table>

<p>
This is an easy problem from Round 1C 2010.
</p>

<p>
The problem's constraints are low enough to allow &Omicron;(n<sup>2</sup>) solutions. 
</p>

<p>
I use <a href="https://github.com/Ramarren/cl-geometry">cl-geometry</a> library to check whether two line segments intersect.
Using the library for such a simple task is of course an overkill, but cl-geometry has plenty of useful functions that can be handy in solving other problems.
</p>

<p>
My solution also demonstrates some simple aspects of using Common Lisp Object System.
</p>

<div class="org-src-container">

<pre class="src src-common-lisp">(ql:quickload <span style="color: #483d8b;">:cl-geometry</span>)
(use-package <span style="color: #483d8b;">:2d-geometry</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">count-intersections</span> (a-list b-list)
  (<span style="color: #a020f0;">let</span> (n a b)
    (setf n (length a-list))
    (setf a (make-array n <span style="color: #483d8b;">:initial-contents</span> a-list))
    (setf b (make-array n <span style="color: #483d8b;">:initial-contents</span> b-list))
    (<span style="color: #a020f0;">loop</span> for i from 0 below n sum
      (<span style="color: #a020f0;">loop</span> for j from (1+ i) below n sum
           (<span style="color: #a020f0;">let</span> (li lj inter)
             (setf li (make-instance 'line-segment
                                     <span style="color: #483d8b;">:start</span> (make-instance 'point <span style="color: #483d8b;">:x</span> 0 <span style="color: #483d8b;">:y</span> (aref a i))
                                     <span style="color: #483d8b;">:end</span> (make-instance 'point <span style="color: #483d8b;">:x</span> 1 <span style="color: #483d8b;">:y</span> (aref b i)) ))
             (setf lj (make-instance 'line-segment
                                     <span style="color: #483d8b;">:start</span> (make-instance 'point <span style="color: #483d8b;">:x</span> 0 <span style="color: #483d8b;">:y</span> (aref a j))
                                     <span style="color: #483d8b;">:end</span> (make-instance 'point <span style="color: #483d8b;">:x</span> 1 <span style="color: #483d8b;">:y</span> (aref b j)) ))
             (setf inter (line-segments-intersection-point li lj))
             (<span style="color: #a020f0;">if</span> inter 1 0)) ) ) ) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">do-case</span> (case-num a b)
  (format t <span style="color: #8b2252;">"Case #~a: ~a~%"</span> case-num (count-intersections a b)) )

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">main</span> ()
  (<span style="color: #a020f0;">loop</span> for case-num from 1 to (read) do
       (<span style="color: #a020f0;">let</span> (n a b)
         (setf n (read))
         (<span style="color: #a020f0;">dotimes</span> (i n)
              (push (read) a)
              (push (read) b) )
         <span style="color: #b22222;">; </span><span style="color: #b22222;">items in a &amp; b are reversed, but it doesn't matter</span>
         (<span style="color: #a020f0;">do-case</span> case-num a b) ) ) )
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">2013-09-30</p>
               <p class="author">Sergii Dymchenko (<a href="mailto:kit1980@gmail.com">kit1980@gmail.com</a>)</p>
               <p class="creator">Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.1.50.1 (<a href="http://orgmode.org">Org</a> mode 8.0.2)</p>
</div>
</body>
</html>